bdd/01_introduccion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-18 Mon 00:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introducción</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/res/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Introducción</h1>
<div id="outline-container-org02b0303" class="outline-2">
<h2 id="org02b0303">Definición de base de datos</h2>
<div class="outline-text-2" id="text-org02b0303">
<p>
Base de datos
</p>
<blockquote>
<p>
Una base de datos es un conjunto de datos interrelacionados.
</p>
</blockquote>

<p>
Pero, ¿qué es para nosotros un dato?
</p>

<p>
Dato
</p>
<blockquote>
<p>
Un dato es un hecho que puede ser representado y almacenado de alguna
forma, y que tiene un sentido implícito.
</p>
</blockquote>

<p>
Ejemplos:
</p>
<ul class="org-ul">
<li>La mesa 5 consumió 2 milanesas napolitanas y 1 botella de vino.</li>
<li>Alberto Malatesta tiene turno para oftalmología el 15/03.</li>
<li>El Nissan GT-R alcanza una velocidad máxima de 315 km/h.</li>
<li>100 gramos de chocolate poseen 546 calorías.</li>
</ul>

<p>
Bases de datos tradicionales vs. no tradicionales
Bases de datos tradicionales. Predicados
</p>

<p>
Las bases de datos tradicionales almacenan datos de texto o
numéricos, que pueden enunciarse a través de proposiciones.
</p>

<p>
Por ejemplo:
</p>
<ul class="org-ul">
<li>Juan Martín Del Potro ganó el Abierto de Estados Unidos en 2009.</li>
<li>Gabriela Sabatini ganó el Abierto de Estados Unidos en 1990.</li>
<li>Roger Federer ganó el Abierto de Australia en 2018.</li>
<li>&#x2026;</li>
<li>[persona] ganó [torneo] en [año]</li>
</ul>

<p>
Un conjunto de proposiciones que tienen la misma estructura puede
tipificarse a través de un predicado.
</p>


<p>
Predicado
  Es una función que toma uno o más argumentos y devuelve un valor de verdad.
</p>

<p>
En el caso anterior, podemos definir la función
GanadorDelGrandSlam(persona, torneo, año). Entonces:
</p>
<ul class="org-ul">
<li>GanadorDelGrandSlam(Roger Federer, Abierto de Australia, 2018) = V</li>
<li>GanadorDelGrandSlam(Marin Cilic, Abierto de Australia, 2018) = F</li>
</ul>

<p>
Atención: Las bases de datos sólo almacenan proposiciones verdaderas.
Lectura sugerida: "What a database really is: Predicates and propositions",
H. Darwen, Warwick University, 1994.
<a href="http://www.dcs.warwick.ac.uk/~hugh/M359/What-a-Database-Really-Is.pdf">http://www.dcs.warwick.ac.uk/~hugh/M359/What-a-Database-Really-Is.pdf</a>
</p>

<p>
Bases de datos tradicionales vs. no tradicionales
</p>

<p>
Bases de datos no tradicionales
</p>

<p>
Actualmente, las bases de datos también almacenan tipos de datos más
complejos como imágenes, audio, video, o datos geoespaciales.
</p>

<p>
En este curso centraremos nuestra atención en las bases de datos
tradicionales.
</p>
</div>
</div>

<div id="outline-container-orge42b09a" class="outline-2">
<h2 id="orge42b09a">Sistemas de Gestión de Bases de Datos</h2>
<div class="outline-text-2" id="text-orge42b09a">
</div>
<div id="outline-container-orgde847f5" class="outline-3">
<h3 id="orgde847f5">Un poco de historia</h3>
<div class="outline-text-3" id="text-orgde847f5">
<p>
¿Cómo organizar el acceso a los datos?
</p>

<p>
Hasta los años ’50, la forma más común
de almacenamiento de datos eran los
ficheros manuales.
</p>

<p>
Con la llegada de las computadoras&#x2026;
</p>

<pre class="example">
Los sistemas de
información crecen y se
vuelven más complejos
(-) Se hace evidente que la relación directa entre programas y datos
es una gran desventaja

Los ficheros se
reemplazan por archivos
en cintas magnéticas
(+) Automatización
(-) Acceso serial a los datos
(-) Baja velocidad


SGBD como alternativa a los archivos individuales
</pre>

<p>
Los datos se ingresaban a través de tarjetas perforadas y eran
almacenados en cintas magnéticas.
</p>

<p>
El procesamiento de las cintas (ordenamiento, merge, búsqueda) se
realizaba típicamente en COBOL.
</p>

<p>
Una desventaja de las cintas era que sólo permitían acceso secuencial.
</p>


<p>
Las cintas imponían fuertes restricciones en cuanto a la forma serial
de acceso para lectura y escritura.
</p>

<p>
Basado en estas restricciones, IBM ideó entre 1960 y 1970 un sistema
de manejo de datos: el Information Management System (IMS). Este SGBD
utilizaba un modelo de datos jerárquico.
</p>

<p>
Si bien el IMS fue superado por los SGBDs relacionales en cuanto a sus
limitaciones, aún se encuentra presente en numerosos mainframes,
ATM’s, y bancos.
</p>
</div>
</div>

<div id="outline-container-orgfc90f57" class="outline-3">
<h3 id="orgfc90f57">Definición</h3>
<div class="outline-text-3" id="text-orgfc90f57">
<p>
¿Qué es entonces un Sistema de Gestión de Bases de Datos (SGBD) o
Database Management System (DBMS)?
</p>

<p>
Sistema de Gestión de Bases de Datos (SGBD)
</p>
<blockquote>
<p>
Es un conjunto de programas que gestiona y controla la creación,
manipulación y acceso a la base de datos.
</p>
</blockquote>

<p>
El SGBD provee un nivel de abstracción entre los programas o sistemas
de información y los datos, resolviendo el problema conocido como
dependencia de datos.
</p>
</div>
</div>

<div id="outline-container-org7720b62" class="outline-3">
<h3 id="org7720b62">Independencia de datos</h3>
<div class="outline-text-3" id="text-org7720b62">
<p>
[elm16 2.2]
</p>

<p>
Independencia de datos
</p>
<blockquote>
<p>
Es la propiedad del SGBD consistente en que cambios en la estructura
de la base de datos no repercutan en los programas o sistemas de
información que la utilizan.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orga8e2503" class="outline-3">
<h3 id="orga8e2503">Algunos hitos</h3>
<div class="outline-text-3" id="text-orga8e2503">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1964</td>
<td class="org-left">General Electric crea el IDS (Information Data Store), un SGBD con un modelo de red.</td>
</tr>

<tr>
<td class="org-right">1966</td>
<td class="org-left">IBM crea el IMS (Information Management System), basado en un modelo jerárquico.</td>
</tr>

<tr>
<td class="org-right">1970</td>
<td class="org-left">Codd –trabajando en IBM–propone el modelo relacional, que se impondrá en la década siguiente.</td>
</tr>

<tr>
<td class="org-right">1975</td>
<td class="org-left">El ANSI/SPARC propone una arquitectura de 3 capas para los SGBDs.</td>
</tr>

<tr>
<td class="org-right">1976</td>
<td class="org-left">Chen propone el modelo Entidad-Interrelación que dominará el diseño conceptual de bases de datos.</td>
</tr>

<tr>
<td class="org-right">1980</td>
<td class="org-left">Surgen SGBDs comerciales basados en el modelo relacional, como DB2 (IBM), y Oracle.</td>
</tr>

<tr>
<td class="org-right">1990s</td>
<td class="org-left">Surgen los primeros SGBDs orientados a objetos.</td>
</tr>

<tr>
<td class="org-right">1992</td>
<td class="org-left">Se estandariza el lenguaje SQL (estándar SQL-92).</td>
</tr>

<tr>
<td class="org-right">1993</td>
<td class="org-left">Surgen los Data Warehouses y OLAP (Online Analytical Processing) como sistemas de soporte para la toma de decisiones.</td>
</tr>

<tr>
<td class="org-right">1998</td>
<td class="org-left">Se estandariza XML como lenguaje de intercambio de datos.</td>
</tr>

<tr>
<td class="org-right">2000</td>
<td class="org-left">Los ERPs (Enterprise Resource Planning) aparecen en escena como una capa de negocio por sobre el SGBD. Ejemplos: SAP ERP, Oracle ERP.</td>
</tr>

<tr>
<td class="org-right">2005</td>
<td class="org-left">De la mano del cloud computing se crean SGBDs distribuidos de alta performance. Ejemplos: BigTable (Google, 2005) y Cassandra (Facebook, 2008) → Movimiento NoSQL.</td>
</tr>

<tr>
<td class="org-right">2010</td>
<td class="org-left">Surge el concepto de Database-as-a-Service. Ejemplos: Microsoft Azure SQL (2010), Google Cloud Datastore (2013), Google Cloud SQL(2014).</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgdcc2da7" class="outline-2">
<h2 id="orgdcc2da7">Arquitectura de 3 capas ANSI/SPARC</h2>
<div class="outline-text-2" id="text-orgdcc2da7">
<p>
El ANSI-SPARC propuso en 1975 una arquitectura en 3 niveles de
abstracción para la descripción/representación de los datos de una
base de datos.
</p>

<p>
[elm16 2.2]
</p>

<ul class="org-ul">
<li>Modelo interno: Representa la forma en que los datos se almacenan
utilizando estructuras de datos y organizaciones de
archivos. Representa cómo perciben los datos el sistema operativo y
el SGBD.</li>

<li>Modelo conceptual: Describe la semántica de los datos, abstrayéndose
de su implementación física. Describe entidades, tipos de datos,
operaciones y restricciones de seguridad y de integridad.</li>

<li>Modelo externo: Representa la forma en que los usuarios perciben los
datos.</li>
</ul>

<blockquote>
<p>
Esta arquitectura asegura la independencia de datos, tanto física como
lógica.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgd154b87" class="outline-2">
<h2 id="orgd154b87">Funciones de los SGBDs</h2>
<div class="outline-text-2" id="text-orgd154b87">
<ul class="org-ul">
<li>Almacenamiento y Consulta
<ul class="org-ul">
<li>Ofrecer estructuras eficientes.</li>
<li>Ofrecer un lenguaje de consulta (aumenta la productividad).</li>
</ul></li>
<li>Integridad
<ul class="org-ul">
<li>Asegurar la integridad de datos a través de restricciones.</li>
</ul></li>
<li>Seguridad
<ul class="org-ul">
<li>Evitar accesos no autorizados.</li>
</ul></li>
<li>Concurrencia
<ul class="org-ul">
<li>Permitir el acceso en simultáneo de muchos usuarios.</li>
</ul></li>
<li>Recuperación
<ul class="org-ul">
<li>Ofrecer herramientas para la recuperación ante fallas.</li>
</ul></li>
<li>Soporte transaccional</li>
</ul>
</div>
</div>

<div id="outline-container-org05e8a3a" class="outline-2">
<h2 id="org05e8a3a">Bibliografía</h2>
<div class="outline-text-2" id="text-org05e8a3a">
<ul class="org-ul">
<li>[ELM16] Fundamentals of Database Systems, 7th Edition. R. Elmasri,
S. Navathe, 2016. Capítulo 1, Capítulo 2.2 Será nuestra referencia
de cabecera.</li>
<li>[SILB10] Database System Concepts, 6th Edition. A. Silberschatz,
H. Korth, S. Sudarshan, 2010. Capítulo 1</li>
<li>[CONN15] Database Systems, a Practical Approach to Design,
Implementation and Management, 6th Edition. T. Connolly,
C. Begg, 2015. Capítulo 1, Capítulo 2.1, 2.3</li>
<li>[GM09] Database Systems, The Complete Book, 2nd
Edition. H. García-Molina, J. Ullman, J. Widom, 2009. Capítulo 1.1</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
Last update: 2019-03-18 00:27
</div>
</body>
</html>
